## Terraform Plan Result


### environments/stg/network/vpc
```

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

### environments/stg/network/subnet
```

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

### environments/stg/network/sg
```

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

### environments/stg/db
```

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

### environments/stg/app/launch_template
```

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

### environments/stg/app/asg
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.asg.aws_autoscaling_group.this will be updated in-place
  ~ resource "aws_autoscaling_group" "this" {
        id                               = "stg-asg"
        name                             = "stg-asg"
        # (32 unchanged attributes hidden)

      ~ instance_refresh {
            # (2 unchanged attributes hidden)

          ~ preferences {
              ~ instance_warmup              = "300" -> "180"
              ~ min_healthy_percentage       = 90 -> 50
                # (7 unchanged attributes hidden)
            }
        }

        # (6 unchanged blocks hidden)
    }

  # module.asg.aws_autoscaling_policy.cpu_target will be created
  + resource "aws_autoscaling_policy" "cpu_target" {
      + arn                     = (known after apply)
      + autoscaling_group_name  = "stg-asg"
      + enabled                 = true
      + id                      = (known after apply)
      + metric_aggregation_type = (known after apply)
      + name                    = "stg-asg-cpu-scaling"
      + policy_type             = "TargetTrackingScaling"
      + region                  = "ap-southeast-2"

      + target_tracking_configuration {
          + disable_scale_in = false
          + target_value     = 50

          + predefined_metric_specification {
              + predefined_metric_type = "ASGAverageCPUUtilization"
            }
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```
<!-- Sticky Pull Request Commentterraform-plan -->